Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 360)               545760    
_________________________________________________________________
dropout (Dropout)            (None, 360)               0         
_________________________________________________________________
dense (Dense)                (None, 128)               46208     
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 608,609
Trainable params: 608,609
Non-trainable params: 0
_________________________________________________________________